tap "homebrew/cask-versions"
tap "buo/cask-upgrade" # usage `brew cu` etc...
tap "homebrew/cask-fonts"
tap "oven-sh/bun"

brew "coreutils"
brew "openssl@1.1"
brew "curl"
brew "git"
brew "mas"

# fonts -- https://gist.github.com/davidteren/898f2dcccd42d9f8680ec69a3a5d350e
cask "font-inter"
cask "font-meslo-lg-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-blex-mono-nerd-font"

brew "zsh"
brew "less"
brew "pure" # nice & clean zsh prompt
brew "rust"
brew "python@3.11"
brew "frum" # fast ruby version manager
brew "neovim"
brew "lazygit"
brew "gh" # github cli
brew "git-delta" # syntax highlighting pager for git, diff, grep output 
brew "unar"
brew "nvm"
brew "TomAnthony/brews/itermocil" # pre-defined layouts+commands in iterm
brew "bun"
brew "lsd" # LSDeluxe - like colorls but no messing with ruby
brew "tree" # lsd does this pretty well, maybe tree isn't needed
brew "fzy"
brew "fd" # find files
brew "tldr"
brew "bat" # like cat, but fancy
# brew "the_silver_searcher" # using ripgrep now
brew "ripgrep"
brew "httpie" # command-line http client
brew "terminal-notifier"
brew "hyperfine" # command-line benchmarking tool
# brew "lima"
# brew "colima"
brew "orbstack" # containers and VMs
# brew "duti" # cli for setting document and url schemes on macos
# brew "pass" # gpg password manager

cask "iterm2"
cask "typora" # nice markdown gui
cask "shottr" # mac screenshot tool
cask "rapidapi" # like postman but mac native
cask "alfred"
cask "caffeine"
cask "bartender"
cask "rectangle"
cask "soundsource"
cask "appcleaner"
# cask "tiny-player"

# menubar stats apps...not using any of these right now
# cask "istat-menus"
# brew "stats"
# cask "menubar-stats"

cask "spotify"
cask "the-unarchiver"
cask "slack"
cask "netnewswire"

# not currently using these:
# cask "little-snitch"
# cask "vmware-fusion"
# cask "codeedit 
# cask "nova"
# cask "maccy" # clipboard manager

# mac app store stuff
mas "StopTheMadness", id: 1376402589
mas "Numbers", id: 409203825
mas "Adguard-for-Safari", id: 1440147259
mas "Wallet", id: 404234608
mas "Pixelmator-Pro", id: 1289583905
mas "Oldr", id: 1475048161
mas "Things-3", id: 904280696
# mas "Display-Menu", id:549083868
